[
    {
        "name": "Системные требования",
	    "header": "Новая солянка - новые требования",
        "text": [
            "Игра поддерживает видеокарты только DirectX 11 и выше (от 4xx серии GeForce).",
            "Больше не поддерживается Windows 7. Это сделано в угоду стабильности и производительности на более-менее современных системах.",
            "Желательно устанавливать игру на системный SSD, где находится файл подкачки.",
            "Не ограничивайте размер файла подкачки в системе! Либо увеличьте его до размера, при котором вылеты прекратятся. Требуемый размер зависит от количества видео + оперативной памяти.",
            "Также до 16 гигабайт оперативной памяти включительно нужно выключить опцию 'Префетч игровых ресурсов'. До 8 включительно - отключить еще и 'Мультипоточную загрузку текстур'.",
            "Рекомендуемые системные требования:",
            "- ГП: Nvidia GeForce RTX 3060",
            "- ЦП: AMD Ryzen 5600 / Intel Core i5-12600",
            "- ОЗУ: 32Gb",
            "- Windows 10",
            "Минимальные системные требования:",
            "- ГП: Nvidia GeForce GTX 1050",
            "- ЦП: AMD Ryzen 3 1200 / Intel Core i5-6400",
            "- ОЗУ: 8Gb",
            "- Windows 10"
        ],
        "centered": false,
        "imagePaths": ["reqs.jpg"],
        "descriptions": null
    },
    {
        "name": "Управление",
        "header": "Управление",
	    "text": [
            "В солянке добавлено много новых элементов управления. Автомобили, инвентарь и предметы на поясе теперь имеют свои кнопки.",
            "Всё, кроме биорадара на кнопку \"Home\" можно настроить в соответствующем разделе настроек.",
            "Помимо простых настроек также добавленые особые действия в инвентаре:",
            "- фильтры предметов через кнопки внизу инвентаря или клавиши 1, 2, 3, 4, 5, 6",
            "- быстрое применение предметов с пояса(выбрать предмет на поясе и нажать клавиши с F1 по F10)",
            "- быстрое опустошение магазинов на поясе - взять магазин, потрясти курсором и положить обратно в слот)",
            "Также добавлены действия через клавиши \"Shift\" и \"Ctrl\":",
            "- Чтобы открыть рюкзак, зажми клавишу \"Shift\" и нажми клавишу инвентаря",
            "- Для предметов в рюкзаке можно вызвать дополнительную информацию для удобства сравнения, наведя курсор на нужный предмет и нажав на клавишу \"Ctrl\"",
            "- Чтобы увидеть подробное описание предмета в окне бартера, зажми клавишу \"Shift\" и наведи курсор на нужный предмет",
            "- Если удерживать клавишу \"Shift\" и нажимать \"+\" или \"−\" на цифровой клавиатуре, можно приближать и отдалять мини-карту",
            "- Чтобы переместить сразу несколько предметов в подсумок, удерживай клавишу \"Shift\" при переносе",
            "- Яркость прибора ночного видения можно изменить, удерживая клавишу \"Shift\" и прокручивая колёсико мыши",
            "- Чтобы шустрее перенести предмет на пояс с быстрыми слотами, дважды щёлкни по нему ЛКМ, при этом зажав клавишу \"Shift\"",
            "Дополнительные функции:",
            "- Если нужно из нычки или жмура быстро взять сразу всё - нажми на латинскую клавишу \"Х\"",
            "- В ПДА, при двойном нажатии ЛКМ на карте во вкладке \"План\", можно поставить свою метку, что здорово облегчит запоминание интересных мест",
            "- Чтобы скрыть элементы интерфейса, нажми \"−\" на цифровой клавиатуре. Для возврата HUD используй клавишу \"+\""
        ],
	    "centered": false,
        "imagePaths": ["controls.png"],
        "descriptions": null
    },
	{
        "name": "Настройки и оптимизация",
        "header": "Настройки и оптимизация",
	    "text": [
            "Пресеты для расширенных настроек теперь заданы достаточно объемно: максимальные уже не те, что 10 лет назад - они действительно для топового железа!",
            "Наиболее сильно сажают fps тени от травы и сглаживание MSAA.",
            "Для обладателей видеокарт NVIDIA 4ххх и 5ххх поколений доступно удвоение частоты кадров! Добавляем xrEngine.exe в список программ в Nvidia App и ставим соответствующую настройку.",
            "Если игра зависает на 88%, попробуйте поменять тип солнечных лучей или освещения."
        ],
	    "centered": false,
        "imagePaths": ["settings.png"],
        "descriptions": null
    },
    {
        "name": "Сюжет солянки",
        "header": "Особенности сюжета",
        "text": [
            "Многие квесты в солянке не имеют указателей, то есть искать тайник/персонажа/мутанта/предмет придётся самому.",
            "Однако в диалогах и описаниях заданий почти всегда написано примерное местоположение цели.",
            "Не пренебрегайте чтением диалогов и описаний(а лучше всегда читайте), чтобы потом не возникало вопросов по поискам или прохождению квеста.",
            "Если какой-то квест очень тяжело выполнить, то в этом гиде или на YouTube-канале солянки можно найти подсказки.",
            "Если даже так квест сдать тяжело, всегда можно предложить изменение в Discord или VK, или спросить других игроков."
        ],
        "centered": false,
        "imagePaths": ["story.png"],
        "descriptions": null
    },
    {
        "name": "Что изменено?",
	    "header": "",
        "text": null,
	    "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "OGSR 2016",
                "header": "Основные изменения солянки",
                "gridImagePath": "icon0.png",
                "imagePaths": ["ogsr.png"],
                "centered": false,
                "text": [
                    "Народная солянка OGSR — это модификация, расширяющая и улучшающая оригинальную игры \"Сталкер: Тень Чернобыля\".",
                    "В сравнении с оригинальной версией, OGSR содержит множество изменений, которые делают игровой процесс более интересным и разнообразным.",
                    "Основные изменения:",
                    "- OGSR включает переработанные текстуры, улучшенную освещенность и новые эффекты, что создает более реалистичную атмосферу по сравнению с базовым ТЧ.",
                    "- В моде появилось множество новых видов оружия, а также улучшены модели существующих. Это расширяет тактический выбор и делает бой более динамичным.",
                    "- Расширены и переработаны квесты и сюжетные линии, улучшено взаимодействие с NPC, что делает прохождение более насыщенным.",
                    "- Баланс оружия, ресурсов и врагов переработан для более реалистичного и сложного прохождения, что требует более продуманной стратегии.",
                    "- Появились дополнительные локации, области, новые точки интереса и секреты, что увеличивает исследовательские возможности игрока.",
                    "- Реализованы новые системы, например: артпреобразование, потребности, переработанная система погоды и динамические события."
                ]
            },
            {
                "name": "OGSR 2026",
                "header": "Нововведения в OGSR 2026",
                "gridImagePath": "icon0.png",
                "imagePaths":[ "ogsr2026.jpg" ],
                "centered": false,
                "text": [
                    "Разработка крупного обновления велась два года, и за это время в игру было внесено множество правок и нововведений, учесть которые в полном объёме невозможно.",
                    "Тем не менее, мы постарались максимально подробно перечислить основные изменения.",
                    "Самые главные изменения:",
                    "- Объём и рюкзаки",
                    "- Ребаланс артефактов и предметов",
                    "- Переделка экономики: бартеров и торговли",
                    "- Быстрое перемещение с помощью проводников и лодок",
                    "- Длительность жизни артефактов",
                    "- Ребаланс брони и добавление шлемов",
                    "- Новые предметы для ГГ(тепловизор, болты, гитара)",
                    "- Новые квесты, ветки и сюжетные сцены",
                    "- Исправлена и доделана база, расширено управление её доходами и расходами",
                    "- В игру добавлен транспорт",
                    "- Новая оружейная система на основе скелета рук Gunslinger",
                    "- Ребаланс ТТХ оружия",
                    "- Реализована система \"реального звука\" — частоты звука динамически корректируются в зависимости от расстояния и препятствий между источником и слушателем",
                    "- Большие изменения ИИ A-Life и стелса",
                    "- Переработан интерфейс",
                    "- Исправлены проблемы на локациях (летающие объекты, дыры, прозрачные и дублирующиеся модели и т.п.)",
                    "- Добавлены новые переходы на локациях, часть старых перемещены",
                    "- и многое-многое другое, о чём можно прочитать в %l=https://discord.com/channels/760456028700803092/1001390477649657896/1455848004220227654%Discord%el%"
                ]
            },
            {
                "name": "Актуальный патч",
                "header": "Актуальный патч",
                "gridImagePath": "icon0.png",
                "imagePaths": ["actual.png"],
                "centered": false,
                "text": [
                    "- Реализовано нормальное скрытие оружия при превышении объема с выводом сообщения на экран",
                    "- Реализован текстурный худ для БТРов (только при виде от 1-го лица)",
                    "- Оптимизирована работа модуля rx_headtracker, исправлен вылет",
                    "- Починка циклических заданий базы",
                    "- Реализовано аномальное поле на Генераторах, где рождаются рубиновые артефакты (полноценная работа гарантируется только с НИ)",
                    "- ГГ открывает подсумок на бегу и с пустыми руками тоже",
                    "- Добавлен запрет на использование телепортов во время выброса",
                    "- Исправлен вылет при использовании телепорта Стрелка с перегрузом",
                    "- Исправлены метки для Сидоровича, Василия",
                    "- Подсказка для трансмутатора выше и отключается при наведении на лежащие объекты",
                    "- Добавлена кнопка \"Открыть рюкзак\"",
                    "- ГГ не может брать ПДА в руки на лестнице",
                    "- Прячем ПДА/Закрываем подсумок, если лезем на лестницу",
                    "- Кол-во предметов отображается только если их больше х1",
                    "- Кастомные метки для проводников и т.д. теперь не наследуют свои родные метки-точки",
                    "- В маскировачном костюме теперь можем брать все аномальные стволы",
                    "- Исправлены анимации прицеливания на ПКМ/ПКП",
                    "- Исправлены лучи фонарика и ЛЦУ на некоторых стволах",
                    "- Поправлен обмен уникальных вещей у Ворона",
                    "- Исправлены волны",
                    "- Исправления по ветке с оленями",
                    "- Уникальный Colt1911 в награду за ЦЗ",
                    "- Чуть больше \"Чёрных энергий\" в продаже у Сахарова и Плотникова",
                    "- Ворон просит за флешку P90 без магазина",
                    "- Вырезаны экзоскелеты из рандомных тайников",
                    "- Убран худ для шлема Сфера-08",
                    "- Улучшено качество значков от bald_panda",
                    "- Местоположение всех значков на полотнах оружия находится в одном и том же месте",
                    "- На полотнах пушек ключик был заменён на шестерёнку (значок уник. предмета)",
                    "- АК-104 и АК Стрелка теперь используют родную текстуру",
                    "- Исправлена иконка такт. ручки у АК-74М",
                    "- Улучшена иконка ТОЗ-34",
                    "- Добавлены точки кота около запчастей в исключения спавна аномалий",
                    "- Проход в дом Механика теперь забит досками изнутри",
                    "- Дополнительный лист металла в доме Механика",
                    "- Убран дублирующий квест, связанный с Ворониным",
                    "- Шахтёр говорит с нами, если поговорили с Хабарычем",
                    "- Добавлена информация про глушители в описание пистолетов",
                    "- Добавлено описание горячих клавиш в контекст игры + обновлены подсказки при загрузках",
                    "- Внесены текстовые и прочие незначительные изменения"
                ]
            }
        ]
    }
]