[
    {
        "name": "Системные требования",
        "header": "Новая солянка - новые требования",
        "text": [
            "Игра поддерживает видеокарты только DirectX 11 и выше (от 4xx серии GeForce).",
            "Больше не поддерживается Windows 7. Это сделано в угоду стабильности и производительности на более-менее современных системах.",
            "Желательно устанавливать игру на системный SSD, где находится файл подкачки.",
            "Не ограничивайте размер файла подкачки в системе! Либо увеличьте его до размера, при котором вылеты прекратятся. Требуемый размер зависит от количества видео + оперативной памяти.",
            "Также до 16 гигабайт оперативной памяти включительно нужно выключить опцию 'Префетч игровых ресурсов'. До 8 включительно - отключить еще и 'Мультипоточную загрузку текстур'.",
            "Рекомендуемые системные требования:",
            "- ГП: Nvidia GeForce RTX 3060",
            "- ЦП: AMD Ryzen 5600 / Intel Core i5-12600",
            "- ОЗУ: 32Gb",
            "- Windows 10",
            "Минимальные системные требования:",
            "- ГП: Nvidia GeForce GTX 1050",
            "- ЦП: AMD Ryzen 3 1200 / Intel Core i5-6400",
            "- ОЗУ: 8Gb",
            "- Windows 10"
        ],
        "centered": false,
        "imagePath": "reqs.jpg",
        "descriptions": null
    },
    {
        "name": "Управление",
        "header": "Управление",
        "text": [
            "В солянке добавлено много новых элементов управления. Автомобили, инвентарь и предметы на поясе теперь имеют свои кнопки.",
            "Всё можно настроить в соответствующем разделе настроек.",
            "Помимо простых настроек также добавленые особые действия в инвентаре:",
            "- фильтры предметов через кнопки внизу инвентаря или клавиши 1, 2, 3, 4, 5, 6",
            "- быстрое применение предметов с пояса(выбрать предмет на поясе и нажать клавиши с F1 по F10)",
            "- быстрое опустошение магазинов на поясе - взять магазин, потрясти курсором и положить обратно в слот)",
            "- быстрое перемещение предметов между инвентарём и тайником - зажать \"Alt\" и навести курсор на нужные предметы",
            "Также добавлены действия через клавиши \"Shift\" и \"Ctrl\":",
            "- Чтобы открыть рюкзак, зажми клавишу \"Shift\" и нажми клавишу инвентаря",
            "- Для предметов в рюкзаке можно вызвать дополнительную информацию для удобства сравнения, наведя курсор на нужный предмет и нажав на клавишу \"Ctrl\"",
            "- Чтобы увидеть подробное описание предмета в окне бартера, зажми клавишу \"Shift\" и наведи курсор на нужный предмет",
            "- Если удерживать клавишу \"Shift\" и нажимать \"+\" или \"−\" на цифровой клавиатуре, можно приближать и отдалять мини-карту",
            "- Чтобы переместить сразу несколько предметов в подсумок, удерживай клавишу \"Shift\" при переносе",
            "- Яркость прибора ночного видения можно изменить, удерживая клавишу \"Shift\" и прокручивая колёсико мыши",
            "- Чтобы шустрее перенести предмет на пояс с быстрыми слотами, дважды щёлкни по нему ЛКМ, при этом зажав клавишу \"Shift\"",
            "Дополнительные функции:",
            "- Если нужно из нычки или жмура быстро взять сразу всё - нажми на латинскую клавишу \"Х\"",
            "- В ПДА, при двойном нажатии ЛКМ на карте во вкладке \"План\", можно поставить свою метку, что здорово облегчит запоминание интересных мест",
            "- Чтобы скрыть элементы интерфейса, нажми \"−\" на цифровой клавиатуре. Для возврата HUD используй клавишу \"+\""
        ],
        "centered": false,
        "imagePath": "controls.png",
        "descriptions": null
    },
    {
        "name": "Настройки и оптимизация",
        "header": "Настройки и оптимизация",
        "text": [
            "Пресеты для расширенных настроек теперь заданы достаточно объемно: максимальные уже не те, что 10 лет назад - они действительно для топового железа!",
            "Наиболее сильно сажают fps тени от травы и сглаживание MSAA.",
            "Для обладателей видеокарт NVIDIA 4ххх и 5ххх поколений доступно удвоение частоты кадров! Добавляем xrEngine.exe в список программ в Nvidia App и ставим соответствующую настройку.",
            "Если игра зависает на 88%, попробуйте поменять тип солнечных лучей или освещения."
        ],
        "centered": false,
        "imagePath": "settings.png",
        "descriptions": null
    },
    {
        "name": "Сюжет солянки",
        "header": "Особенности сюжета",
        "text": [
            "Многие квесты в солянке не имеют указателей, то есть искать тайник/персонажа/мутанта/предмет придётся самому.",
            "Однако в диалогах и описаниях заданий почти всегда написано примерное местоположение цели.",
            "Не пренебрегайте чтением диалогов и описаний(а лучше всегда читайте), чтобы потом не возникало вопросов по поискам или прохождению квеста.",
            "Если какой-то квест очень тяжело выполнить, то в этом гиде или на YouTube-канале солянки можно найти подсказки.",
            "Если даже так квест сдать тяжело, всегда можно предложить изменение в Discord или VK, или спросить других игроков."
        ],
        "centered": false,
        "imagePath": "story.png",
        "descriptions": null
    },
    {
        "name": "Что изменено?",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "OGSR 2016",
                "header": "Основные изменения солянки",
                "gridImagePath": "icon0.png",
                "imagePath": "ogsr.png",
                "centered": false,
                "text": [
                    "Народная солянка OGSR — это модификация, расширяющая и улучшающая оригинальную игры \"Сталкер: Тень Чернобыля\".",
                    "В сравнении с оригинальной версией, OGSR содержит множество изменений, которые делают игровой процесс более интересным и разнообразным.",
                    "Основные изменения:",
                    "- OGSR включает переработанные текстуры, улучшенную освещенность и новые эффекты, что создает более реалистичную атмосферу по сравнению с базовым ТЧ.",
                    "- В моде появилось множество новых видов оружия, а также улучшены модели существующих. Это расширяет тактический выбор и делает бой более динамичным.",
                    "- Расширены и переработаны квесты и сюжетные линии, улучшено взаимодействие с NPC, что делает прохождение более насыщенным.",
                    "- Баланс оружия, ресурсов и врагов переработан для более реалистичного и сложного прохождения, что требует более продуманной стратегии.",
                    "- Появились дополнительные локации, области, новые точки интереса и секреты, что увеличивает исследовательские возможности игрока.",
                    "- Реализованы новые системы, например: артпреобразование, потребности, переработанная система погоды и динамические события."
                ]
            },
            {
                "name": "OGSR 2026",
                "header": "Нововведения в OGSR 2026",
                "gridImagePath": "icon0.png",
                "imagePath": "ogsr2026.jpg",
                "centered": false,
                "text": [
                    "Разработка крупного обновления велась два года, и за это время в игру было внесено множество правок и нововведений, учесть которые в полном объёме невозможно.",
                    "Тем не менее, мы постарались максимально подробно перечислить основные изменения.",
                    "Самые главные изменения:",
                    "- Объём и рюкзаки",
                    "- Ребаланс артефактов и предметов",
                    "- Переделка экономики: бартеров и торговли",
                    "- Быстрое перемещение с помощью проводников и лодок",
                    "- Длительность жизни артефактов",
                    "- Ребаланс брони и добавление шлемов",
                    "- Новые предметы для ГГ(тепловизор, болты, гитара)",
                    "- Новые квесты, ветки и сюжетные сцены",
                    "- Исправлена и доделана база, расширено управление её доходами и расходами",
                    "- В игру добавлен транспорт",
                    "- Новая оружейная система на основе скелета рук Gunslinger",
                    "- Ребаланс ТТХ оружия",
                    "- Реализована система \"реального звука\" — частоты звука динамически корректируются в зависимости от расстояния и препятствий между источником и слушателем",
                    "- Большие изменения ИИ A-Life и стелса",
                    "- Переработан интерфейс",
                    "- Исправлены проблемы на локациях (летающие объекты, дыры, прозрачные и дублирующиеся модели и т.п.)",
                    "- Добавлены новые переходы на локациях, часть старых перемещены",
                    "- и многое-многое другое, о чём можно прочитать в %l=https://discord.com/channels/760456028700803092/1001390477649657896/1455848004220227654%Discord%el%"
                ]
            },
            {
                "name": "Патч от 11.02.2026",
                "header": "Патч от 11.02.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Исправлена проблема, когда техник не возвращал предмет после починки",
                    "- Исправлено растягивание иконок в сообщениях",
                    "- Исправлено лечение НПС одной аптечкой, а также отображение потерянного предмета при лечении",
                    "- Исправлен дюп артефактов и рюкзаков",
                    "- Исправлена варка \"Огненного шара\" из \"Холодца\"",
                    "- При выбрасывании рубиновых артефактов в аномалии больше не выдаётся рецепт",
                    "- При полном перегрузе телепортеры не работают, а также недоступны услуги проводников",
                    "- Заменена скриптовая проверка метки красного псевдогиганта",
                    "- Исправлены вылеты, связанные с CUIWeaponCellItem, CKinematics и UILines в ПДА",
                    "- Вертолёты на ЧАЭС-1 улетают по таймеру",
                    "- Исправлена худовая анимация шлема Сфера-12М",
                    "- Подключены разные варианты шейдерного стекла для противогазов",
                    "- Исправлена привязка худовых моделей шлемов",
                    "- Исправлена привязка лазера у РПК-74 и АЕК-971, а также шейдер тритиевой подсветки у снайперского SG550",
                    "- Прицелы ПКМ и ПКП теперь имеют более близкое приближение в режиме прицеливания",
                    "- Исправлено прицеливание на РПК и РПК-74",
                    "- Исправлен апгрейд для \"Грача\"",
                    "- Исправлено отображение объёма в инвентаре (значение выходило за рамку)",
                    "- Добавлено зелёное свечение для артефакта \"Ночная звезда\"",
                    "- Волк после КСП выдаёт денежную награду",
                    "- Исправлен квест \"Технический вопрос\"",
                    "- Внесены текстовые и прочие незначительные изменения"
                ]
            },
            {
                "name": "Патч от 09.02.2026",
                "header": "Патч от 09.02.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Реализована система вывода сообщения на экран при получении заметки в журнале, а также рецептов артефактов",
                    "- Реализована сортировка в бартере",
                    "- Был доработан и доведён до ума мп3 и теперь он работает",
                    "- Реализовано назначение клавиш на слоты для девайсов, можно включать/выключать любые детекторы, включая биорадар",
                    "- Добавлена блокировка выброса в сцене со сходкой авторитетов и на охоте на оленя",
                    "- Добавлена таблица для НПС, которым запрещено быть проводниками",
                    "- Реализован звук для фонящих монстров",
                    "- Исправлено неправильное отображение кол-ва вещей",
                    "- Исправлено прицеливание на ПКМ и ПКП",
                    "- Сахаров может теперь чинить броню и шлема",
                    "- Пси-шлемы теперь можно чинить только через Сахарова",
                    "- Исправлена шкала состояния предмета в ремнаборе",
                    "- Пси-шлемы стоят дороже",
                    "- Квестовые артефакты и изоморфы теперь не портятся",
                    "- Модификаты теперь портятся чуть быстрее",
                    "- Сохраняем текущий уровень топлива в транспорте при переходах",
                    "- Исправлен расход топлива у машин",
                    "- Исправлено вместительность бака у машин",
                    "- Повышены иммунитеты у КамАЗ, Урал 4320, БТР-60 и БРДМ-2, а так же исправлены иммунитеты у белой Нивы 2121",
                    "- Увеличен объем для следующего транспорта: КамАЗ, Урал 4320, УАЗ-452 \"Ржавый\" и УАЗ-31514, а так же урезан у следующего транспорта: ЗАЗ-965, ЗАЗ-968, \"Ржавая Лада 2101\" и Багги",
                    "- Машины дымятся при 30% ХП",
                    "- Во время анимации надевания шлема не можем бегать и доставать оружие",
                    "- Подключён худ для наручных комбинезонов",
                    "- Можем получить только одну коробку сигар",
                    "- Подключена визуальная смена подствольных гранат для оружия с ГП-25 \"Костёр\"",
                    "- Фикс слотов под магазины и быстрые предметы",
                    "- Исправлено прицеливание на РПГ с апгрейдом",
                    "- Исправлены два рандомных тайника на Болотах и в Лощине",
                    "- Добавлены рандомный спавн магазинов в новые тайники Матвея Кулинара",
                    "- Исправлен вылет по ветке \"Базы\"",
                    "- Исправлен вылет по xr_kamp",
                    "- Перенесена коробка от часового в Лабиринте",
                    "- Фикс спавна наёмника на Кордоне",
                    "- Исправлены иконки некоторых \"долговцев\"",
                    "- Добавлена запись в ПДА про тайник Лукаша",
                    "- Перед прерыванием функции заводим таймер",
                    "- Фикс диалога с Барменом про покупку машины",
                    "- Исправлена тритиевая подсветка на СВУ с прицелами",
                    "- Исправлена текстура рюкзака у Искры",
                    "- Фикс редкого вылета по amk_offline_alife",
                    "- Добавлен прикол в кресте",
                    "- Внесены текстовые и прочие изменения"
                ]
            },
            {
                "name": "Патч от 02.02.2026",
                "header": "Патч от 02.02.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Реализовано нормальное скрытие оружия при превышении объема с выводом сообщения на экран",
                    "- Реализован текстурный худ для БТРов (только при виде от 1-го лица)",
                    "- Оптимизирована работа модуля rx_headtracker, исправлен вылет",
                    "- Починка циклических заданий базы",
                    "- Реализовано аномальное поле на Генераторах, где рождаются рубиновые артефакты (полноценная работа гарантируется только с НИ)",
                    "- ГГ открывает подсумок на бегу и с пустыми руками тоже",
                    "- Добавлен запрет на использование телепортов во время выброса",
                    "- Исправлен вылет при использовании телепорта Стрелка с перегрузом",
                    "- Исправлены метки для Сидоровича, Василия",
                    "- Подсказка для трансмутатора выше и отключается при наведении на лежащие объекты",
                    "- Добавлена кнопка \"Открыть рюкзак\"",
                    "- ГГ не может брать ПДА в руки на лестнице",
                    "- Прячем ПДА \\ закрываем подсумок, если лезем на лестницу",
                    "- Кол-во предметов отображается только если их больше х1",
                    "- Кастомные метки для проводников и т.д. теперь не наследуют свои родные метки-точки",
                    "- В маскировачном костюме теперь можем брать все аномальные стволы",
                    "- Исправлены анимации прицеливания на ПКМ/ПКП",
                    "- Исправлены лучи фонарика и ЛЦУ на некоторых стволах",
                    "- Поправлен обмен уникальных вещей у Ворона",
                    "- Исправлены волны на воде",
                    "- Исправления по ветке с оленями",
                    "- Уникальный Colt1911 в награду за ЦЗ",
                    "- Чуть больше \"Чёрных энергий\" в продаже у Сахарова и Плотникова",
                    "- Ворон просит за флешку P90 без магазина",
                    "- Вырезаны экзоскелеты из рандомных тайников",
                    "- Убран худ для шлема Сфера-08",
                    "- Улучшено качество значков от bald_panda",
                    "- Местоположение всех значков на полотнах оружия находится в одном и том же месте",
                    "- На полотнах пушек ключик был заменён на шестерёнку (значок уник. предмета)",
                    "- АК-104 и АК Стрелка теперь используют родную текстуру",
                    "- Исправлена иконка такт. ручки у АК-74М",
                    "- Улучшена иконка ТОЗ-34",
                    "- Добавлены точки кота около запчастей в исключения спавна аномалий",
                    "- Проход в дом Механика теперь забит досками изнутри",
                    "- Дополнительный лист металла в доме Механика",
                    "- Убран дублирующий квест, связанный с Ворониным",
                    "- Шахтёр говорит с нами, если поговорили с Хабарычем",
                    "- Добавлена информация про глушители в описание пистолетов",
                    "- Добавлено описание горячих клавиш в контекст игры + обновлены подсказки при загрузках",
                    "- Внесены текстовые и прочие незначительные изменения"
                ]
            },
            {
                "name": "Патч от 29.01.2026",
                "header": "Патч от 29.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Обновлены иконки ГГ в диалогах с НПС",
                    "- Исправлен вылет с биноклем из-за звука (на этот раз точно)",
                    "- Исправлены вылеты, связанные с headtracker",
                    "- Исправлены случаи при которых НПС крутят головами на 180° (вероятно не все)",
                    "- Фикс лагов из-за поехавших объектов",
                    "- В исключения добавлено оружие, которое нельзя апгрейдить",
                    "- Техники больше не торгуют своими личными вещами",
                    "- Если у ГГ не хватает денег на маршрут, он сообщает об этом проводнику",
                    "- Исправлены модели ножей. Теперь заточенная сторона ножа \"смотрит\" вперёд",
                    "- Добавлены апгрейды для БМ-16 и ТОЗ-34",
                    "- Улучшено качество иконок НПС и окна Скат-15",
                    "- Урезано содержимое секретного тайника на Болотах",
                    "- Внесены текстовые и прочие незначительные изменения"
                ]
            },
            {
                "name": "Патч от 27.01.2026",
                "header": "Патч от 27.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- В связи с исправлением основной массы критических проблем принято решение исключить из движка AVX2 инструкции",
                    "- Улучшены иконки оружия, брони, аддонов, пачек патронов и другого снаряжения",
                    "- Добавлен значок на иконках уникального оружия",
                    "- Исправлено отображение некоторых мутантов на уникальном биорадаре",
                    "- Исправления в ветках Шёпота, Наташи и базы",
                    "- Экономнее тратятся ресурсы базы",
                    "- Усилен сторож Кидалы",
                    "- Фикс сцены с оленями на Затоне",
                    "- Бродяга не заселяется на Барьере",
                    "- Труп охранника Кидалы теперь исчезает",
                    "- Доцент и Долговязый бессмертные",
                    "- Денис в КЛ спавнится без контролёров",
                    "- Исключен спавн аномалий во втором здании на пути Десанта",
                    "- Перенесена коробка на пути Десанта",
                    "- Внесены правки для Токаря",
                    "- Харона теперь нельзя лечить",
                    "- В прицеливании руки трясутся меньше",
                    "- Бессмертный БТР на АС",
                    "- Исправлена выдача рецепта от Призрака за блокноты",
                    "- Фикс вылета по headtracker",
                    "- Фикс вылета по недоочистке сигналов при выгрузке уровня",
                    "- Урезана награда у Захара за ЦЗ",
                    "- Понижен коэф. накрутки денег за случайные события ещё больше",
                    "- Даём в награду 1 теплак вместо 5",
                    "- АК-104-105 в средний слот",
                    "- Апгрейд для MGL",
                    "- Заменены партиклы выстрелов у Чейтака",
                    "- На \"Грозе\" остаётся ручка для переноски после апгрейда цевья",
                    "- На сайгу с планкой Пикатинни можно вешать прицелы на \"Ласточкин хвост\"",
                    "- Убран апгрейд на штык-нож у \"Мосинки\"",
                    "- Исправлено прицеливание на некоторых стволах",
                    "- Исправлен свет и линия ЛЦУ на некоторых пушках",
                    "- Исправлено прерывание перезарядки у дробовиков после уникальной анимации зарядки первого патрона",
                    "- Фикс отображения магазина на иконке пушке в диалоге при получении от техника",
                    "- Исправлен момент, когда гранаты/болты и пр. предметы не всегда стакались",
                    "- Фикс растягивающихся плотей + небольшие правки физики",
                    "- Фикс вылета level_path.empty()",
                    "- Фикс вылета по BlowoutParticles",
                    "- Фикс очередного вылета по CSoundRender_Emitter",
                    "- Увеличены размеры нетпакета и StackReserveSize",
                    "- Заменено содержимое тайника на Затоне",
                    "- Исправлены некоторые иконки НПС",
                    "- Внесены текстовые и прочие незначительные исправления"
                ]
            },
            {
                "name": "Патч от 22.01.2026",
                "header": "Патч от 22.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Правильные сборные иконки в бартере и ПДА",
                    "- Реализовано окно управления Скат-15",
                    "- Теперь Наташа на дальних дистанциях будет стрелять одиночными \\ по 2 патрона. Также, чем ближе враг - тем длиннее будет очередь",
                    "- Фикс сцены с Шепотом",
                    "- Исправлены софтлоки по сюжету Наташи",
                    "- Обновлена модель АА-12 на новую, более качественную",
                    "- Добавлено крепление для фонарика/ЛЦУ и соответствующие апгрейды под ним",
                    "- Добавлен апгрейд на установку планки Пикатинни, для установки прицелов",
                    "- Добавлены прицелы для АА-12 (установка только при наличии апгрейда)",
                    "- Внесены текстовые и прочие незначительные исправления"
                ]
            },
            {
                "name": "Патч от 21.01.2026",
                "header": "Патч от 21.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Исправлен дюп предметов в диалогах",
                    "- Исправлена проблема спавна живности и НПС на Агропроме",
                    "- Исправлен вылет после взятия телепорта Харона",
                    "- Заменены все иконки НПС на более качественные от bald_panda",
                    "- Скорректирован доход базы",
                    "- Корректировки у Вовы Виста по описанию разведчиков",
                    "- Прицел с задержкой дыхания стабилизируется быстрее",
                    "- В квесте тест пистолетов теперь не засчитываются убийства с другого оружия",
                    "- Добавлен ещё вариант сообщения после тестирования всех пистолетов",
                    "- Вэл после Варлаба продаёт редкое с более высоким шансом",
                    "- Скорректирован урон по псевдособакам",
                    "- Исправления биорадара",
                    "- Улучшены свойства у артефакта \"Колобок\" и его модификатов",
                    "- Усилен персонаж Кальтер",
                    "- Заменён дубликат визуала Волка по ветке Шёпота",
                    "- Фикс вертолёта в ТД по квесту Лиса",
                    "- Исправлена текстура рюкзака Искры",
                    "- Корректировки по headtracker",
                    "- Добавлены скриптовые экспорты из dsh",
                    "- Доработана независимость CellItem от объекта",
                    "- Тестово исправлен вылет _valid(new_shell_last->mXFORM)",
                    "- Новая модель АА-12",
                    "- Фикс модели РПК",
                    "- Внесены текстовые и прочие незначительные исправления"
                ]
            },
            {
                "name": "Патч от 20.01.2026",
                "header": "Патч от 20.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Доделано окно ремонта/апгрейда: все иконки отображаются корректно, оружие сохраняется полностью в том виде, в котором отдали ремонтнику (наличие обвесов и магазина, точное количество патронов)",
                    "- Реализовано отображение реальных иконок потерянных/полученных предметов в диалогах",
                    "- Реализованы метки для проводников, техников и торговцев (часть из них будут работать только на новой игре)",
                    "- Реализована система управления головой НПС",
                    "- Доведена до ума механика с задержкой дыхания",
                    "- Фикс меток трупов на биорадаре после перезагрузки",
                    "- Реализована охрана для бункера учёных на Юпитере",
                    "- Исправлены повторяющиеся сообщения на локациях",
                    "- Добавлен новый квест на Тест пистолетов",
                    "- Арни теперь торговец",
                    "- Исправлена точка перемещения в Припять при переходе через проводника",
                    "- Добавлены новые локации на выбор в диалоге проводника и часть локаций была убрана",
                    "- Гарик теперь пропускает бесплатно, если принести ему сладости",
                    "- Вернули истории у костров",
                    "- Исправлен вылет при одевании брони на арене",
                    "- Исправлен один из вылетов, связанный с эмиттерами",
                    "- Исправлен вылет при использовании бинокля",
                    "- Исправлен вылет в диалоге с Вовой Вистом",
                    "- Исправлен вылет из-за партиклов",
                    "- Добавлено новое оружие Dessert Eagle WTS",
                    "- Повышен урон у АШ-12",
                    "- Немного улучшены ТТХ экзоскелета Чёрного Доктора",
                    "- Артефакты в Х-18 теперь уничтожаются быстрее",
                    "- Уменьшен множитель денежной награды за случайные события",
                    "- Добавлен БТР около туннеля с переходом в Шахту для отстрела живности",
                    "- Заварены люки и дверцы на БТР-60, БТР-82А и БРДМ-2",
                    "- Антенна на БТР-82А больше не дёргается",
                    "- Добавлены в игру ржавые стволы для зомби",
                    "- Исправлены звуки дробовиков и винтовок со скользящим затвором",
                    "- Добавлены звуки для снайперской винтовки Chaytac M200",
                    "- Исправлен клипующий ДТК с глушителем на АКС-74у",
                    "- Заменены иконки аномального оружия, магазинов и брони",
                    "- Исправлен бамп у АКМ",
                    "- Изменены материалы у АКМ и ВСС/ВАЛ",
                    "- Исправлены апгрейды для следующего оружия: Форт-17, Walther P99, L86A2, MP5SD2, FN F2000 \"Палач\", MP9, Glock18, Sig SG550 \"Снайперский\", РПК-74, Remington 870 и Гроза Воронина",
                    "- Исправлен fire point у БМ-16 и его короткой версии",
                    "- Исправлен shoot point на некоторых стволах",
                    "- Переходник для установки глушителя на Форт-17 в стоке",
                    "- Добавлена локализация апгрейда тыльника для ПП \"Бизон\" и АК-74У",
                    "- Исправлена иконка апгрейдов Desert Eagle Silver",
                    "- Добавлен топовый рюкзак в продажу Вэлу",
                    "- FiveSeven и магазин к нему в бартер Вэлу",
                    "- Сяк теперь торгует 12.7х55",
                    "- Чуть больше рюкзаков в продажу",
                    "- Добавлены редкие эмбрионы в несколько тайников",
                    "- Аким и Адреналин теперь торгуют эмбрионами, а Плотников больше ими не торгует",
                    "- Исправлена цена продажи Чёрной энергии у Плотникова",
                    "- Адреналин продаёт АПС реже",
                    "- Добавлены некоторые пистолетные магазины в продажу Петренко и Скряге",
                    "- Повышена стоимость водки в бартере",
                    "- L86A2 в бартере Акима теперь дешевле",
                    "- СР2М в бартере Сяку и Remington700 чуть дороже",
                    "- Обмен Рубиновой Батарейки на обычную у Сахарова",
                    "- Витамин теперь дополнительно выдаёт хороший рюкзак",
                    "- Аким даёт в награду ПНВ вместо тепловизора",
                    "- Шуруп даёт ПНВ покруче",
                    "- Гавр за первый квест даёт тепловизор",
                    "- Добавлен замок во второй тайник Кости",
                    "- Исправлена проблема с исчезновением трупа сталкера на Радаре по квесту Сахарова",
                    "- Исправлен доход участникам базы",
                    "- Усилены квестовые НПС по квестам базы",
                    "- Инженер усилен в экзоскелете Чёрного Доктора",
                    "- Исправлены условия выполнения квеста \"Снайперский выстрел\"",
                    "- Исправлена логика Жеки в Лощине",
                    "- Исправлен спавн прибора Хакера",
                    "- Наташа в плаще при первой встрече",
                    "- Озвучка у Наташи теперь чуть тише",
                    "- Страшные звуки кристаллов Тени Монолита при получении урона",
                    "- Добавлена проверка на выброс в ветке Тридогнайта",
                    "- Исправлен диалог у Десанта",
                    "- Исправлена метка на Химеру",
                    "- Добавлена метка на Пулю по его заданию в Тёмной Долине",
                    "- Убираем метку с собаки по квесту на Затоне",
                    "- Наташа условно садится в машину",
                    "- Снегирю арт на всякий пожарный",
                    "- Редкий зверь под защиту на всякий случай",
                    "- Лесник просит 10 грибов вместо 20",
                    "- Охотники НЗ выходят в онлайн после диалога с Шахтёром",
                    "- В тайнике радиста теперь спавнится топовый рюкзак",
                    "- Фраеру теперь рандомится более мощная пушка",
                    "- Джостик Андерсена спавнится после диалога с Призраком",
                    "- Добавлена заметка в ПДА про машины, которыми торгует Сидорович",
                    "- Изделие #4 теперь в ящике",
                    "- Экзоскелет ЧД теперь можно выкладывать",
                    "- Исправления в ветке Наташи и Шёпота",
                    "- Внесены текстовые и прочие незначительные исправления"
                ]
            },
            {
                "name": "Патч от 11.01.2026",
                "header": "Патч от 11.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Исправлен вылет связанный с путями НПС",
                    "- Доработано отключение ПДА",
                    "- Фикс вылета !Device.Rendering()",
                    "- Возвращена анимация передергивания затвора в прицеливании",
                    "- Доработка перезарядки и её логики анимаций у Мосинки и Револьвера",
                    "- Возможно пофикшено пропадание рук после загрузки игры",
                    "- Сделаны апгрейды для: СКС, СВ-98, РГМ-40, РПГ-7 и всех пистолетов",
                    "- Добавлены новые апгрейды на подствольный гранатомёт для L85 и альтернативный огонь для FN SCAR-H SV",
                    "- Фикс абуза вещей арены",
                    "- Проводник не выполняет свои функции, если ранен или идет выброс",
                    "- Проводник в Лощине занимает свою работу по условию",
                    "- Исправлен вылет меню ремонта/апгрейда на 21х9",
                    "- Вариация вариаций вариативных диалогов у Скряги и Угрюмого",
                    "- Кристаллы по квесту Бой с Тенью не хитуются, только разрушение",
                    "- Удаляем Наташу с крыши даже если не подобрали записку",
                    "- Исправлена наводка местоположения Шёпота",
                    "- Изменена награда в квестах Макса и Лукаша",
                    "- Исправлено удаление партиклов в Х-18 по квесту Рубеж",
                    "- Добавлена локализация апгрейда на Штык-нож",
                    "- Штык-ножи апгрейдом пока ставить не можем",
                    "- Подключены иконки для Халявы и Шурика Фроста",
                    "- Немного урезаны рандомные списки вооружения наёмников",
                    "- Убран тестовый диалог апгрейда у Андрея Механика",
                    "- Усилен персонаж Лис",
                    "- Уменьшено кол-во здоровья Костыльноге",
                    "- Фикс спавна брони для Пантеры",
                    "- Фиксированная награда вместо рандомной от Десантника за его квест",
                    "- Фиксы по ветке Наташи",
                    "- Фикс вылета при смерти Гарика",
                    "- Более точная наводка на тайник Кости на ЧАЭС-2",
                    "- Фиксы секретной сцены на Болотах"
                ]
            },
            {
                "name": "Патч от 09.01.2026",
                "header": "Патч от 09.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Доделано круговое меню",
                    "- Реализовано меню апгрейда",
                    "- Сделаны апгрейды для: G36 всех вариаций, Сайга12К, Вепрь12, Протекта, MP-133, MP-153, Mossberg 590, Spas12, Remington 870, Winchester 1300, Winchester \"Chaser\", ТОЗ-34 и Обрез ТОЗ-34",
                    "- Добавлена анимация такт. ручки для UMP45 и HK416 в апгрейде",
                    "- Исправлена иконка Winchester \"Chaser\" с глушителем",
                    "- Запрещаем ставить тритиевую подсветку для L85, если стоит планка Пикатинни",
                    "- Фикс размытия внутри прицела при включенном dof",
                    "- Убран прицел ЕКП у АК-74У \"Спецназ\"",
                    "- Исправлена иконка Форт-17 с глушителем",
                    "- Глушитель на Форт-17 теперь поставить только апгрейдом",
                    "- Winchester 1300 в средний и большой слот",
                    "- Фикс положения рук и оружия после загрузки игры",
                    "- Финальная правка кровососов в деревне на Армейских Складах",
                    "- Фикс задания с машиной базы",
                    "- Исправлена фраза в диалоге с Шахтёром",
                    "- Кровосос по квесту Захара теперь чуть слабее",
                    "- Исправлены условия в задании Кузнецова на компромат",
                    "- Были добавлены новые проверки для апгрейдов",
                    "- Доктор по квесту с нами говорит только тогда, когда нашли 2-й тайник",
                    "- Фикс варки при выбрасывании всех артов",
                    "- Мелкие текстовые правки"
                ]
            },
            {
                "name": "Патч от 07.01.2026",
                "header": "Патч от 07.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Сделаны апгрейды для: СВУ, ПКМ, ПКП, М249, L85A1 с прицелом и без, L86A2, SG 550, SG 550 \"Штурмовой\", SG 550 \"Снайперский\", ВСС Винторез, Винторез \"Падальщик\", HK417, SR25, ОЦ-14 \"Гроза\", ОЦ-14 \"Гроза Воронина\", FN F2000, FN F2000 \"Палач\", MP5, MP5 SD, MP5 \"Кустарь\", UMP-45, MP9, P90, SR2M, Uzi, Scorpion",
                    "- Исправлены проблемы с уже существующими апгрейдами оружия",
                    "- Исправлено прицеливание на Winchester 1300 и Winchester \"Chaser\"",
                    "- Отображение реальных иконок в окне ремонта и апгрейда",
                    "- Не теряем апгрейды и не снимаем обвесы при ремонте",
                    "- Исправлен вылет в диалоге с Угрюмым",
                    "- Откат шейдера затемнения террейна при намокании",
                    "- Исправлен квест Скряги на кровососов",
                    "- Исправлен первый диалог с Пулей",
                    "- Заменены партиклы дыма после выстрела у СВУ",
                    "- Добавлено укрытие от выброса на базе ЧН в доме на Болотах",
                    "- Фикс телека Акима",
                    "- Добавлено больше здоровья кристаллам Тени Монолита",
                    "- Исправлена кодировка метки по квесту Бармена",
                    "- Правильный меш пачки патронов 9х18 изоморф",
                    "- Фиксы иконок MP-5 и L85",
                    "- Новое полотно для грейженного MP-9",
                    "- Текстовые правки"
                ]
            },
            {
                "name": "Патч от 05.01.2026",
                "header": "Патч от 05.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Починка софтлока сюжета",
                    "- Фикс телепортов",
                    "- Фикс Мосинки в бартере Сяка",
                    "- Фикс выдачи наград у Свиблова и Андрея Механика",
                    "- Фикс вылета по af_babka_2",
                    "- Вывод реальной иконки в круговое меню",
                    "- Переход намокания плавнее + дальность"
                ]
            },
            {
                "name": "Патч от 04.01.2026",
                "header": "Патч от 04.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Фикс вылета boxCurr <= ammo_obj->m_boxSize",
                    "- Фикс работы скролла во всплывающем описании предметов",
                    "- Исправлены причины неправильной регистрации НПС в смартах (без поломки сейвов)",
                    "- Новые волюметрики от ламп от <@822732315671134208>",
                    "- Донастройка освещения в подземках",
                    "- Фикс точки дула ППШ",
                    "- Потерянный шейдер невидимых ног",
                    "- Подключены нужные анимации к пушкам с апгрейдами",
                    "- Удаление БТРов в Лощине, если они не были уничтожены",
                    "- Заменен Рубиновый Булыжник на обычный в Пещере",
                    "- Укороченный АК Стрелка -> АК-104 \"Стрелка\"",
                    "- Фикс выдачи таска на разговор с Ворониным",
                    "- Радиус адекватный квестовых ситуаций",
                    "- Фикс Мосинки",
                    "- Мелкие текстовые правки"
                ]
            },
            {
                "name": "Патч от 02.01.2026",
                "header": "Патч от 02.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Доисправлено ломание сохранений",
                    "- Перенастроено освещение",
                    "- Переписан скрипт динамического тонмапа",
                    "- Убраны лишние опции из настроек"
                ]
            },
            {
                "name": "Патч от 01.01.2026",
                "header": "Патч от 01.01.2026",
                "gridImagePath": "icon0.png",
                "imagePath": "actual.png",
                "centered": false,
                "text": [
                    "- Исправлено ломание сохранений",
                    "- Исправлены вылеты в пещере (возможно, не все)",
                    "- Возвращена зарядка магазинов магазинами",
                    "- Изменено содержимое некоторых тайников Кулинара",
                    "- Доработка розжига костров",
                    "- Глок-17 в бартере с Яку",
                    "- Фикс 81-й подсказки на загрузочном экране"
                ]
            }
        ]
    }
]