[
    {
        "name": "Поиски пропавшей экспедиции",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "Введение",
                "header": "ПДА Военного",
                "gridImagePath": "Locations/kordon.png",
                "imagePath": "Quests/Expedition/andrey_spec.png",
                "centered": false,
                "text": [
                    "В вагончике около Толика находим труп спецназовца.",
                    "В трупе находим записку - начинается задание \"ПДА Военного\" из ветки о поисках пропавшей научной группы.",
                    "Далее по сюжету будем натыкаться на цели этого задания."
                ]
            },
            {
                "name": "Бандит",
                "header": "Бандит",
                "gridImagePath": "Locations/svalka.png",
                "imagePath": "Quests/Expedition/band_pda.png",
                "centered": false,
                "text": [
                    "За стройкой на Свалке получаем сигнал SOS от раненого сталкера.",
                    "Приходим, %s%убиваем этого бандита, берём с него ПДА.%es%",
                    "Далее история ведёт Меченого в Тёмную Долину."
                ]
            },
            {
                "name": "Фраер",
                "header": "Фраер",
                "gridImagePath": "Locations/dolina.png",
                "imagePath": "Quests/Expedition/fraer.png",
                "centered": false,
                "text": [
                    "В комплексе над лабораторией X-18 убиваем бандита Фраера и забираем с него ПДА."
                ]
            },
            {
                "name": "Прапор",
                "header": "ПДА у Прапора",
                "gridImagePath": "Characters/prapor.png",
                "imagePath": "Characters/prapor.png",
                "centered": false,
                "text": [
                    "После выполнения нескольких заданий Прапора Меченому становится доступен сюжетный диалог по зашифрованному ПДА.",
                    "Приносим Прапору 10 научных аптечек, получаем ПДА.",
                    "Бежим к Бармену и узнаём, что за починку от нас требуют %s%артефакт \"Слёзы Огня\"%es%.",
                    "Приносим, получаем зашифрованный ПДА, и отправляемся искать электронщика."
                ]
            },
            {
                "name": "Взломщик",
                "header": "Взломщик от бога",
                "gridImagePath": "Characters/hacker.png",
                "imagePath": "Characters/hacker.png",
                "centered": false,
                "text": [
                    "Отправляемся говорить с Костей. Тот знает о взломщике, который может помочь расшифровать ПДА.",
                    "Для связи с ним нужно включить реле на одном из генераторов в Лощине. Чтобы туда забраться, необходимо приманить аномалию \"Лифт\" с помощью \"Чёрной Энергии\".",
                    "Возвращаем антенну к жизни, ловим много посланий от неизвестных.",
                    "На карте появляется метка - предположительное местоположение хакера.",
                    "Отправляемся в пещеру, находим Саню Хакера.",
                    "Отдаём ему ПДА для расшифровки и очищаем дорогу из пещеры от зомби.",
                    "Встречаем контроллёра, расправляемся с ним и возвращаемся к Хакеру.",
                    "Хакер расшифровывает ПДА и даёт наводку на члена экспедиции на Болотах."
                ]
            },
            {
                "name": "На пороховой бочке",
                "header": "На пороховой бочке",
                "gridImagePath": "Locations/marsh.png",
                "imagePath": "Locations/marsh.png",
                "centered": false,
                "text": [
                    "Отправляемся на Болота и ищем члена пропавшей экспедиции в забаррикадированном доме.",
                    "Подходим к дому по воде, запрыгиваем в окно и находим %s%труп наёмника с ПДА Ары%es%.",
                    "Из данных узанём, что Сивый находится на Дикой Территории. Отправляемся на поиски."
                ]
            }
        ]
    }
]