[
    {
        "name": "Вылеты",
	    "header": "Вылет в лаунчере/игре",
        "text": [
            "Если вылетает при первом запуске: убедитесь, что вы установили данный софт из папки с игрой (installdxwebsetup.exe, VC_redist.x64.exe).",
            "Если вылетает при запуске игры из лаунчера: проверьте целостность файлов или перекачайте игру. Ссылки на скачивание есть в гиде и в медиаресурсах солянки.",
            "Если вылетает после обновлений в игре: возможно, обновление сломало что-то в вашем сохранении. Нужно откатиться назад или начать новую игру. Также хорошо бы отправить баг-репорт с логом и сохранением."
        ],
        "imagePath": "starting.png",
        "descriptions": null
    },
	{
        "name": "Техническая поддержка",
        "header": "Техническая поддержка",
        "text": [
            "Теперь тех. поддержка осуществляется  через новую систему тикетов.",
            "Ознакомьтесь с %l=https://discord.com/channels/760456028700803092/1427708960898678804%правилами публикации%el%, прежде чем публиковать репорт."
        ],
        "centered": false,
        "imagePath": "support.png",
        "descriptions": null
    },
	{
        "name": "Когда новая версия?",
        "header": "Когда обнова?",
        "text": [
            "Сами не знаем. Наберитесь терпения."
        ],
        "centered": true,
        "imagePath": "when.png",
        "descriptions": null
    },
	{
        "name": "Ваши идеи",
        "header": "Ваши идеи",
        "text": [
            "Мы не против выслушивать идеи игроков. И на многие предложения решаем коллективом. Однако, идеи вроде переносимого веса на 400 кг или же хардкорные правки (как сохранения у костров в стиле нлс) даже рассматриваться не будут."
        ],
        "centered": false,
        "imagePath": "ideas.png",
        "descriptions": null
    },
	{
        "name": "Помощь разработчикам",
        "header": "Хочу помочь разработке",
        "text": [
            "Мы всегда рады принять помощь.",
            "Напишите @D1m0n в Discord, с ним можно обсудить где и как вы бы могли помочь.",
            "Если хотите поддержать проект рублём, все способы представлены в %l=https://discord.com/channels/760456028700803092/1128020943378337815/1128022677416837240%Discord%el%"
        ],
        "centered": false,
        "imagePath": "help.jpg",
        "descriptions": null
    },
    {
        "name": "Правки гида",
        "header": "Правки гида",
        "text": [
            "Вы можете добавлять свои правки двумя путями:",
            "1 - сделать правку для всех пользователей(помочь разработчику в его нелёгком деле). Напишите @carefall в Discord, с ним можно обсудить новые материалы.",
            "2 - сделать локальную правку(для себя). Для этого откройте файл categories_custom.json и измените нужную категорию, изменив пути до .json файлов с контентом(или добавьте свою новую категорию со своими путями).",
            "Далее создайте json-файлы для контента категории (как пример можно взять items.json). Настройте необходимые поля, заполните пути до картинок(и не забудьте добавить эти картинки в папку Assets/Images рядом с лаунчером).",
            "Перезапустите гид и ваши правки(при условии что всё настроено верно) отобразятся в нём.",
            "Автообновление на ваши кастомные правки не влияет(пока .json файлы и картинки не носят таких же названий, что и в репозитории). Поэтому можете смело обновляться с выходом новых версий гида.",
            "С помощью кастомных правок можно, например, перевести гид на английский(заменить названия всех базовых категорий через custom, а также поменяв ссылки на файлы с контентом на свои, где вы перевели все элементы на английский)."
        ],
        "centered": false,
        "imagePath": "gidfix.png",
        "descriptions": null
    },
	{
        "name": "Сюжет солянки",
        "header": "Особенности сюжета",
        "text": [
            "Многие квесты в солянке не имеют указателей, то есть искать тайник/персонажа/мутанта/предмет придётся самому.",
            "Однако в диалогах и описаниях заданий почти всегда написано примерное местоположение цели.",
            "Не пренебрегайте чтением диалогов и описаний(а лучше всегда читайте), чтобы потом не возникало вопросов по поискам или прохождению квеста.",
            "Если какой-то квест очень тяжело выполнить, то в этом гиде или на YouTube-канале солянки можно найти подсказки.",
            "Если даже так квест сдать тяжело, всегда можно предложить изменение в Discord или VK, или спросить других игроков."
        ],
        "centered": false,
        "imagePath": "story.png",
        "descriptions": null
    },
    {
        "name": "Правки",
        "header": "Народное творчество",
        "text": [
            "Даже для последнего патча сообщество разрабатывает правки.",
            "Список правок можно посмотреть в %l=https://discord.com/channels/760456028700803092/1169134699176800306%соответствующем разделе%el% в Discord.",
            "!!При игре с правками техническая поддержка недоступна. Команда солянки не будет рассматривать ваше обращение!!"
        ],
        "centered": true,
        "imagePath": "pravki.png",
        "descriptions": null
    }
]