[
    {
        "name": "Янтарь - Побочные",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "Сахаров",
                "header": "Сахаров",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После посещения Меченым X-18 у Сахарова появляется диалог, начинающий квест \"Рубеж\" по отключению деактиватора артефактов в лаборатории.",
                    "Идём к Долговязому, получаем наводку на поиски электроники.",
                    "Первую часть находим в %s%здании НИИ на агропроме%es%.",
                    "Вторую часть находим в %s%ящиках в комплексе над лаборатирей%es%.",
                    "Приносим электронику Долговязому, ждём 6 часов и получаем %s%прибор для отключения системы защиты%es%.",
                    "Спускаемся в X-18, %s%доходим до зала с огненным полтергейстом, поднимаемся в комнатку и подключаем прибор к ПК%es%.",
                    "!! Для выполнения задания необходим работающий генератор (по заданию \"Погружение во тьму\") !!",
                    "После посещения Меченым X-16 и доставке им документов Призрака, выдаёт задание на поиск артефакта \"Бусы бабки бюрера\" в обмен на переход %s%Агропром-Янтарь%es%.",
                    "Также к этому моменту появляется опция в диалоге, связанная с квестом Адреналина на Миниган.",
                    "После выполнения Меченым задания на поиск бус, выдаёт задание на кражу документов военных на агропроме, в которых содержится информация о переходе Янтарь-Агропром.",
                    "Документы находятся на %s%озере в вагончике%es%.",
                    "Далее выдаёт задание \"Научные трактаты\" на поиск трёх книг в лабораториях",
                    "После нахождения артефакта \"Плазменная гусеница\" за \"Безоар\" или 50000 рублей предлагает рецепт варки этого артефакта."
                ]
            },
            {
                "name": "Майор Батя",
                "header": "Майор Батя",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После разговора Меченого с Сахаровым на Янтарь прилетает военный - Майор Батя",
                    "Выдаёт задание \"Иголка в траве\" на поиск вещи на Дикой Территории с детектором, который нужно получить у Сахарова",
                    "Находим, приносим Сахарову, получаем в награду миниган для Адреналина."
                ]
            },
            {
                "name": "Круглов",
                "header": "Круглов",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После посещения Меченым X-16 выдаёт задание на поиск декодера в лаборатории X-16.",
                    "Декодер находится у %s%стены за одним из больших компьютеров на одном из ярусов вокруг мозга в колбе%es%.",
                    "Приносим прибор, получаем в награду %s%способ артпреобразования%es%.",
                    "Далее выдаёт задание \"Зарплата лаборанта\" на доставку Сидоровичу контейнера с артефактом.",
                    "Доставляем контейнер Сидоровичу, получаем кейс с деньгами и несём Круглову.",
                    "В награду от Круглова получаем %s%способ артпреобразования%es%."
                ]
            }
        ]
    },
    {
        "name": "Поиски Призрака и убийц Клыка",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "Введение",
                "header": "Введение",
                "gridImagePath": "icon0.png",
                "imagePath": "house.png",
                "centered": false,
                "text": [
                    "Ветвь начинается с квестов:",
                    "- Фримена по поиску %gl=quests/q_bar/1%\"Пустынного Орла\"%egl%",
                    "- Лысого по поиску %gl=quests/q_yantar/1/7%клада%egl% в Пещере",
                    "- Сахарова по поиску %gl=quests/q_yantar/0/0%ПДА Призрака%egl%.",
                    "Данная ветвь относится к \"Новому Сюжету\" солянки и является основной ветвью.",
                    "Далее перетекает в основной сюжет солянки(ЧАЭС-2 больше не концовка игры).",
                    "По этой ветке Меченый пройдёт через Пещеру, Лабиринт, Болота и прочие локации, которых нет в ТЧ."
                ]
            },
            {
                "name": "Фримен",
                "header": "Фримен",
                "gridImagePath": "icon0.png",
                "imagePath": "house.png",
                "centered": false,
                "text": [
                    "В процессе..."
                ]
            },
            {
                "name": "Сахаров",
                "header": "Сахаров",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "Выдаёт задание по поиску ПДА Призрака в X-16.",
                    "Пда находится в %s%том же зале с контроллёром, где и труп Призрака - в первой комнате справа на полке.%es%.",
                    "Приносим ПДА, получаем в награду %s%артефакт и следующее задание - \"След Клыка\"%es%."
                ]
            },
            {
                "name": "Круглов",
                "header": "Круглов",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После посещения Меченым X-16 выдаёт задание \"Дневник призрака\" на поиск дневника на Янтаре.",
                    "Дневник находится на %s%козырьке здания справа от ворот. Запрыгнуть туда можно с помощью бочки и щитков на стене%es%.",
                    "Приносим, получаем в награду %s%2 гранаты ВОГ-25П%es% и новое задание \"Ключ или отмычка\"."
                ]
            },
            {
                "name": "Бармен",
                "header": "Бармен",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После доставки дневника призрака Круглову, у Бармена появляется диалог по поводу Призрака.",
                    "Бармен выдаёт задание на доставку артефакта \"Симбион\".",
                    "Приносим, получаем в награду %s%информацию о похожем на Призрака сталкере%es% и новое задание \"Зов Науки\"."
                ]
            },
            {
                "name": "Воронин",
                "header": "Экза для Воронина",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "За информацию о Клыке Воронин просит принести ему маскировочный экзоскелет с АТП.",
                    "Отправляемся на АТП, забираем экзоскелет с %s%чердака жёлтого здания с огромной лестницей снаружи%es%, приносим.",
                    "В награду получаем %s%два артефакта и наводку на Осведомителя в Баре%es%."
                ]
            },
            {
                "name": "Осведомитель",
                "header": "ПДА Тирана для Осведомителя",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "После выполнения задания Воронина на АТП получаем наводку на Осведомителя.",
                    "За информацию по убийце Клыка Осведомитель просит принести ему ПДА Тирана с церкви на Болотах.",
                    "Штурмуем церковь, забираем пда, а дальше хз..."
                ]
            },
            {
                "name": "Лысый",
                "header": "Клад для Лысого",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "При первом посещении блокпоста Долга на Свалке Меченому приходит сообщение о поиске добровольца для добычи клада.",
                    "Приходим в бар и встречаем Лысого. Он выдаёт задание \"Ценный горшочек\" и открывает переход Свалка-Пещера",
                    "Теперь Меченому открыт путь в Пещеру, а значит и к Шахтёру, который нужен по сюжету.",
                    "Приходим в пещеру, разбиваем горшочек, собираем монетки и относим Лысому.",
                    "В диалоге лучше выбрать %s%сдать все монеты, потому что они потом нигде не нужны%es%.",
                    "В награду получаем %s%40000 рублей и координаты тайника%es%."
                ]
            },
            {
                "name": "Сейф и Шкаткулка 1",
                "header": "Сейф и Шкатулка - Пещера",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "При первой в встрече с Шахтёром в пещере тот выдаёт задание на поиск книги в Забытом Лесу.",
                    "Книга находится на %s%юго-Западном краю локации, в камнях около вертолёта%es%.",
                    "Добываем, %s%отстреливаемся%es%, приносим, получаем в награду артефакт \"Электрический микроб\"",
                    "Далее выдаёт задание \"Пленник лабиринта\" и открывает переходы Пещера-Лабиринт и Лабиринт-Пещера.",
                    "Спасаем Фиму, возвращаемся к Шахтёру, ждём пока Фима оклимается.",
                    "Приносим фиме 10 научных аптечек, 10 бинтов, артефакт \"Душа\" и 3 мыла с Кордона.",
                    "Фима рассказывает о шкатулке и сейфе, а также о бессмертном монолитовце. Идём в лабиринт..."
                ]
            },
            {
                "name": "Сейф и Шкатулка 2",
                "header": "Сейф и Шкатулка - Лабиринт",
                "gridImagePath": "saharov.png",
                "imagePath": "saharov.png",
                "centered": false,
                "text": [
                    "Фима рассказывает Меченому о бессмертном монолитовце и шкатулке с сейфом.",
                    "Идём зачищать монолитовцев%s%, попутно разбивая кристаллы%es%.",
                    "Когда всех зачистили, ищем глазками телепорт.",
                    "%s%Кидаем болт в электры и прыгаем за ним, телепортируемся в аномальную зону.%es%",
                    "Находим шкатулку, %s%в описании находим коды к дверям%es%.",
                    "%s%Попутно не забываем ломать все кристаллы%es%.",
                    "Возвращаемся к монолитовцам на уровень с дверью, открываем кодовый замок и штурмуем.",
                    "Находим код от ещё одной двери и сейф, открываем, добиваем всех монолитовцев и уходим",
                    "Разбиваем последний кристалл и уничтожаем \"Тень монолита\".",
                    "Возвращаемся к Шахтёру, отдаём шкатулку и сейф, уходим выполнять другие задания.",
                    "В следующий раз к Шахтёру заглянем в рамках задания \"Хрен его знает\"."
                ]
            }
        ]
    }
]