[
    {
        "name": "Янтарь - Побочные",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "Сахаров",
                "header": "Сахаров",
                "gridImagePath": "Characters/saharov.png",
                "imagePath": "Characters/saharov.png",
                "centered": false,
                "text": [
                    "1. После посещения Меченым X-18 у Сахарова появляется диалог, начинающий задание \"Рубеж\" по отключению деактиватора артефактов в лаборатории.",
                    "Идём к Долговязому, получаем наводку на поиски электроники.",
                    "Первую часть находим в %s%здании НИИ на агропроме%es%.",
                    "Вторую часть находим в %s%ящиках в комплексе над лаборатирей%es%.",
                    "Приносим электронику Долговязому, ждём 6 часов и получаем %s%прибор для отключения системы защиты%es%.",
                    "Спускаемся в X-18, %s%доходим до зала с огненным полтергейстом, поднимаемся в комнатку и подключаем прибор к ПК%es%.",
                    "!! Для выполнения задания необходим работающий генератор (по заданию \"Погружение во тьму\") !!",
                    "2. После посещения Меченым X-16 и доставке им документов Призрака, выдаёт задание на поиск артефакта \"Бусы бабки бюрера\" в обмен на переход %s%Агропром-Янтарь%es%.",
                    "3. Также к этому моменту появляется опция в диалоге, связанная с заданием Адреналина на Миниган.",
                    "4. После выполнения Меченым задания на поиск артефакта, выдаёт задание на кражу документов военных на агропроме, в которых содержится информация о переходе Янтарь-Агропром.",
                    "5. Документы находятся на %s%озере в вагончике%es%.",
                    "%img=Quests/case_saharov.png%Документы%eimg%",
                    "6. Далее выдаёт задание \"Научные трактаты\" на поиск трёх книг в лабораториях",
                ]
            },
            {
                "name": "Майор Батя",
                "header": "Майор Батя",
                "gridImagePath": "Characters/batya.png",
                "imagePath": "Characters/batya.png",
                "centered": false,
                "text": [
                    "После разговора Меченого с Сахаровым на Янтарь прилетает военный - Майор Батя",
                    "Выдаёт задание \"Иголка в траве\" на поиск вещи на Дикой Территории с детектором, который нужно получить у Сахарова",
                    "%img=Quests/kasseta.png%Предмет на Дикой Территории%eimg%",
                    "Находим, приносим Сахарову, получаем в награду миниган для Адреналина."
                ]
            },
            {
                "name": "Круглов",
                "header": "Круглов",
                "gridImagePath": "Characters/kruglov.png",
                "imagePath": "Characters/kruglov.png",
                "centered": false,
                "text": [
                    "1. После посещения Меченым X-16 выдаёт задание на поиск декодера в лаборатории X-16.",
                    "Декодер находится у %s%стены за одним из больших компьютеров на одном из ярусов вокруг мозга в колбе%es%.",
                    "%img=Quests/dekoder.png%Декодер%eimg%",
                    "Приносим прибор, получаем в награду %s%способ артпреобразования%es%.",
                    "2. Далее выдаёт задание \"Зарплата лаборанта\" на доставку Сидоровичу контейнера с артефактом.",
                    "Доставляем контейнер Сидоровичу, получаем кейс с деньгами и несём Круглову.",
                    "В награду от Круглова получаем %s%способ артпреобразования%es%.",
                    "3. Через некоторое время просит Меченого принести необычный артефакт из ангара на Янтаре в обмен на универсальный детектор аномалий."
                ]
            }
        ]
    }
]