[
    {
        "name": "Вылеты",
        "header": "Вылет в лаунчере/игре",
        "text": [
            "Если вылетает при первом запуске: убедитесь, что вы установили данный софт из папки с игрой (installdxwebsetup.exe, VC_redist.x64.exe).",
            "Если вылетает при запуске игры из лаунчера: проверьте целостность файлов или перекачайте игру. Ссылки на скачивание есть в гиде и в медиаресурсах солянки.",
            "Если вылетает после обновлений в игре: возможно, обновление сломало что-то в вашем сохранении. Нужно откатиться назад или начать новую игру. Также хорошо бы отправить баг-репорт с логом и сохранением."
        ],
        "imagePath": "Faq/starting.png",
        "descriptions": null
    },
    {
        "name": "Техническая поддержка",
        "header": "Техническая поддержка",
        "text": [
            "Теперь тех. поддержка осуществляется  через новую систему тикетов.",
            "Ознакомьтесь с %l=https://discord.com/channels/760456028700803092/1427708960898678804%правилами публикации%el%, прежде чем публиковать репорт."
        ],
        "centered": false,
        "imagePath": "Faq/support.png",
        "descriptions": null
    },
    {
        "name": "Когда новая версия?",
        "header": "Когда обнова?",
        "text": [
            "Сами не знаем. Наберитесь терпения."
        ],
        "centered": true,
        "imagePath": "UI/when.png",
        "descriptions": null
    },
    {
        "name": "Ваши идеи",
        "header": "Ваши идеи",
        "text": [
            "Мы не против выслушивать идеи игроков. И на многие предложения решаем коллективом. Однако, идеи вроде переносимого веса на 400 кг или же хардкорные правки (как сохранения у костров в стиле нлс) даже рассматриваться не будут."
        ],
        "centered": false,
        "imagePath": "Faq/ideas.png",
        "descriptions": null
    },
    {
        "name": "Помощь разработчикам",
        "header": "Хочу помочь разработке",
        "text": [
            "Мы всегда рады принять помощь.",
            "Напишите @D1m0n в Discord, с ним можно обсудить где и как вы бы могли помочь.",
            "Если хотите поддержать проект рублём, все способы представлены в %l=https://discord.com/channels/760456028700803092/1128020943378337815/1128022677416837240%Discord%el%"
        ],
        "centered": false,
        "imagePath": "Faq/help.jpg",
        "descriptions": null
    },
    {
        "name": "Правки гида",
        "header": "Правки гида",
        "text": [
            "Вы можете добавлять свои правки двумя путями:",
            "1 - сделать правку для всех пользователей(помочь разработчику в его нелёгком деле). Напишите @carefall в Discord, с ним можно обсудить новые материалы.",
            "2 - сделать локальную правку(для себя). Для этого откройте файл categories_custom.json и измените нужную категорию, изменив пути до .json файлов с контентом(или добавьте свою новую категорию со своими путями).",
            "Далее создайте json-файлы для контента категории (как пример можно взять Assets/Custom/faq_game.json). Настройте необходимые поля, заполните пути до картинок(и не забудьте добавить эти картинки в папку Assets/Images).",
            "Перезапустите гид и ваши правки(при условии что всё настроено верно) отобразятся в нём.",
            "Автообновление на ваши кастомные правки не влияет. Поэтому можете смело обновляться с выходом новых версий гида.",
            "С помощью кастомных правок можно, например, перевести гид на английский(заменить названия всех базовых категорий через custom, а также поменяв ссылки на файлы с контентом на свои, где вы перевели все элементы на английский)."
        ],
        "centered": false,
        "imagePath": "Faq/gidfix.png",
        "descriptions": null
    },
    {
        "name": "Правки",
        "header": "Народное творчество",
        "text": [
            "Даже для последнего патча сообщество разрабатывает правки.",
            "Список правок можно посмотреть в %l=https://discord.com/channels/760456028700803092/1169134699176800306%соответствующем разделе%el% в Discord.",
            "!!При игре с правками техническая поддержка недоступна. Команда солянки не будет рассматривать ваше обращение. Обращайтесь к разработчику правок. !!"
        ],
        "centered": true,
        "imagePath": "Faq/pravki.png",
        "descriptions": null
    },
    {
        "name": "Прочее",
        "header": "Всякая всячина",
        "text": [
            "Q: Почему нет меток трупов и врагов на миникарте?",
            "A: Теперь это платная фича. Соответствующий функционал приобретается у Доцента в Баре.",
            "Q: Почему не отображается радиация?",
            "A: Теперь для этого нужен дозиметр(приобретается у торговцев или выдаётся в качестве награды за задания).",
            "Q: Почему военные под мостом на Кордоне стреляют?",
            "A: Военные на насыпи стреляют по Меченому всегда. Кузнецов и его отряд стреляют по Меченому только ночью. Ночью выбирайте другой путь для прохода к Свалке. Если Кузнецов нападает, подождите денёк и его агрессия спадёт.",
            "Q: Помогите, у меня прозрачная миникарта",
            "A: Переключите биорадар(назначение кнопок для предметов на поясе находится в настройках)."
        ],
        "centered": false,
        "imagePath": "Faq/pravki.png",
        "descriptions": null
    }
]