[
    {
        "name": "Системные требования",
        "header": "Новая солянка - новые требования",
        "text": [
            "Игра поддерживает видеокарты только DirectX 11 и выше (от 4xx серии GeForce).",
            "Больше не поддерживается Windows 7. Это сделано в угоду стабильности и производительности на более-менее современных системах.",
            "Желательно устанавливать игру на системный SSD, где находится файл подкачки.",
            "Не ограничивайте размер файла подкачки в системе! Либо увеличьте его до размера, при котором вылеты прекратятся. Требуемый размер зависит от количества видео + оперативной памяти.",
            "Также до 16 гигабайт оперативной памяти включительно нужно выключить опцию 'Префетч игровых ресурсов'. До 8 включительно - отключить еще и 'Мультипоточную загрузку текстур'.",
            "Рекомендуемые системные требования:",
            "- ГП: Nvidia GeForce RTX 3060",
            "- ЦП: AMD Ryzen 5600 / Intel Core i5-12600",
            "- ОЗУ: 32Gb",
            "- Windows 10",
            "Минимальные системные требования:",
            "- ГП: Nvidia GeForce GTX 1050",
            "- ЦП: AMD Ryzen 3 1200 / Intel Core i5-6400",
            "- ОЗУ: 8Gb",
            "- Windows 10"
        ],
        "centered": false,
        "imagePath": "Faq/reqs.jpg",
        "descriptions": null
    },
    {
        "name": "Управление",
        "header": "Управление",
        "text": [
            "В солянке добавлено много новых элементов управления. Автомобили, инвентарь и предметы на поясе теперь имеют свои кнопки.",
            "Всё можно настроить в соответствующем разделе настроек.",
            "Помимо простых настроек также добавленые особые действия в инвентаре:",
            "- фильтры предметов через кнопки внизу инвентаря или клавиши 1, 2, 3, 4, 5, 6",
            "- быстрое применение предметов с пояса(выбрать предмет на поясе и нажать клавиши с F1 по F10)",
            "- быстрое опустошение магазинов на поясе - взять магазин, потрясти курсором и положить обратно в слот)",
            "- быстрое перемещение предметов между инвентарём и тайником - зажать \"Alt\" и навести курсор на нужные предметы",
            "Также добавлены действия через клавиши \"Shift\" и \"Ctrl\":",
            "- Чтобы открыть рюкзак, зажми клавишу \"Shift\" и нажми клавишу инвентаря",
            "- Для предметов в рюкзаке можно вызвать дополнительную информацию для удобства сравнения, наведя курсор на нужный предмет и нажав на клавишу \"Ctrl\"",
            "- Чтобы увидеть подробное описание предмета в окне бартера, зажми клавишу \"Shift\" и наведи курсор на нужный предмет",
            "- Если удерживать клавишу \"Shift\" и нажимать \"+\" или \"−\" на цифровой клавиатуре, можно приближать и отдалять мини-карту",
            "- Чтобы переместить сразу несколько предметов в подсумок, удерживай клавишу \"Shift\" при переносе",
            "- Яркость прибора ночного видения можно изменить, удерживая клавишу \"Shift\" и прокручивая колёсико мыши",
            "- Чтобы шустрее перенести предмет на пояс с быстрыми слотами, дважды щёлкни по нему ЛКМ, при этом зажав клавишу \"Shift\"",
            "Дополнительные функции:",
            "- Если нужно из нычки или жмура быстро взять сразу всё - нажми на латинскую клавишу \"Х\"",
            "- В ПДА, при двойном нажатии ЛКМ на карте во вкладке \"План\", можно поставить свою метку, что здорово облегчит запоминание интересных мест",
            "- Чтобы скрыть элементы интерфейса, нажми \"−\" на цифровой клавиатуре. Для возврата HUD используй клавишу \"+\""
        ],
        "centered": false,
        "imagePath": "Faq/controls.png",
        "descriptions": null
    },
    {
        "name": "Настройки и оптимизация",
        "header": "Настройки и оптимизация",
        "text": [
            "Пресеты для расширенных настроек теперь заданы достаточно объемно: максимальные уже не те, что 10 лет назад - они действительно для топового железа!",
            "Наиболее сильно сажают fps тени от травы и сглаживание MSAA.",
            "Для обладателей видеокарт NVIDIA 4ххх и 5ххх поколений доступно удвоение частоты кадров! Добавляем xrEngine.exe в список программ в Nvidia App и ставим соответствующую настройку.",
            "Если игра зависает на 88%, попробуйте поменять тип солнечных лучей или освещения."
        ],
        "centered": false,
        "imagePath": "Faq/settings.png",
        "descriptions": null
    },
    {
        "name": "Сюжет солянки",
        "header": "Особенности сюжета",
        "text": [
            "Многие квесты в солянке не имеют указателей, то есть искать тайник/персонажа/мутанта/предмет придётся самому.",
            "Однако в диалогах и описаниях заданий почти всегда написано примерное местоположение цели.",
            "Не пренебрегайте чтением диалогов и описаний(а лучше всегда читайте), чтобы потом не возникало вопросов по поискам или прохождению квеста.",
            "Если какой-то квест очень тяжело выполнить, то в этом гиде или на YouTube-канале солянки можно найти подсказки.",
            "Если даже так квест сдать тяжело, всегда можно предложить изменение в Discord или VK, или спросить других игроков."
        ],
        "centered": false,
        "imagePath": "Faq/story.png",
        "descriptions": null
    }
]