[
    {
        "name": "База",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "База - Начало",
                "header": "База - Начало",
                "gridImagePath": "Characters/halyava.png",
                "imagePath": "Characters/halyava.png",
                "centered": false,
                "text": [
                    "1. На базе \"Чистого Неба\" говорим Халявой. Получаем задание \"Дом всем желающим\".",
                    "2. Идём в Тёмную Долину организовывать базу сталкеров на месте бывшей базы Борова.",
                    "3. Встречаемся с Халявой в кабинете Борова, получаем задание \"Начало - половина успеха\"."
                ]
            },
            {
                "name": "Половина успеха",
                "header": "Начало - половина успеха",
                "gridImagePath": "Characters/lis.png",
                "imagePath": "Characters/lis.png",
                "centered": false,
                "text": [
                    "1. После разговора с Халявой направляемся искать проверенных сталкеров для Базы.",
                    "2. Первым делом идём в Лощину к Лису. Приглашаем его на базу и идём по своим делам.",
                    "3. Через некоторое время встречаемся с Лисом базе. Беседуем по поводу его деятельности и отправляемся к Халяве.",
                    "4. Переговариваем с Халявой, выбираем охранника для кабинета(Если при первом посещении X-18 спасали Мессера, то охранником станет он).",
                    "5. Дальше уходим по своим делам."
                ]
            },
            {
                "name": "Первые дела",
                "header": "Охрана и первое дело",
                "gridImagePath": "Characters/messer.png",
                "imagePath": "Characters/messer.png",
                "centered": false,
                "text": [
                    "1. Встречаем на базе Мессера, переговариваем.",
                    "2. Далее отправляемся к Халяве. Обсуждаем выбор охранников для базы.",
                    "!! Выбор охраны никак не влияет на сюжет. !!",
                    "3. Далее с Халявой проворачиваем \"Первое дело\" на Кордоне - прикрываем Халяву во время сделки у элеватора.",
                    "4. После сделки отправляемся по своим делам."
                ]
            },
            {
                "name": "Курьер",
                "header": "Курьер",
                "gridImagePath": "Locations/dolina.png",
                "imagePath": "Locations/dolina.png",
                "centered": false,
                "text": [
                    "1. Нанимаем охрану, переговариваем с Лисом и Халявой. Узнаём, что Халява ждёт курьера на Базе.",
                    "2. Идём по своим делам, возвращаемся через некоторое время.",
                    "3. Встречаем на базе Гошу Челнока, обсуждаем дела.",
                    "4. Идём к Лису организовывать охрану кабинета и к Бармену за электриком."
                ]
            },
            {
                "name": "Да будет свет",
                "header": "Да будет свет",
                "gridImagePath": "Characters/barmen.png",
                "imagePath": "Characters/barmen.png",
                "centered": false,
                "text": [
                    "1. Просим у Бармена предоставить на базу электрика.",
                    "2. Через некоторое время приходим на базу и говорим с Халявой.",
                    "3. Узнаём, что электрик провёл свет и ушёл. Также Халява рассказывает о новом торговце на Базе.",
                    "4. Беседуем с торговцем Филом.",
                    "После беседы Фил отправляется в свой кабинет.",
                    "С этого момента базу можно открывать для посетителей."
                ]
            },
            {
                "name": "Доктор Айболит",
                "header": "Доктор Айболит",
                "gridImagePath": "Characters/leonid.png",
                "imagePath": "Characters/leonid.png",
                "centered": false,
                "text": [
                    "1. После открытия базы говорим с Халявой. Тот предлагает нанять на базу медика.",
                    "Медик нанимается через %s%Сахарова на Янтаре%es%.",
                    "2. Докладываем о разговоре Халяве и возвращаемся на базу через несколько дней.",
                    "3. Встречаем нового медика. Переговариваем с ним и с Халявой."
                ]
            },
            {
                "name": "Тишина в библиотеке",
                "header": "Тишина в библиотеке",
                "gridImagePath": "Characters/lis.png",
                "imagePath": "Characters/lis.png",
                "centered": false,
                "text": [
                    "После открытия базы говорим с Лисом. Тот просит раздобыть литературу по охране.",
                    "Отправляемся в Припять..."
                ]
            },
            {
                "name": "Артефакты на базу",
                "header": "Артефакты на базу",
                "gridImagePath": "Characters/fil.png",
                "imagePath": "Characters/fil.png",
                "centered": false,
                "text": [
                    "1. После открытия базы говорим с Филом. Тот просит раздобыть по одному контейнеру для артов разных видов, простой детектор артефактов и оранжевый комбинезон учёных.",
                    "Также упоминает от лагере военных у разбитого вертолёта на Дикой Территории.",
                    "2. Штурмуем лагерь. В комнатке Волкодава в разбиваемом ящике находим три контейнера.",
                    "%img=Quests/Baza/baza_kont.png%Контейнеры%eimg%",
                    "3. В соседней комнате в разбиваемом ящике находим бронежилет и детектор.",
                    "%img=Quests/Baza/baza_kostum.png%Костюм и детектор%eimg%",
                    "4. Возвращаемся на базу, отдаём вещи Филу."
                ]
            },
            {
                "name": "Чудесные пилюли",
                "header": "Чудесные пилюли",
                "gridImagePath": "Characters/leonid.png",
                "imagePath": "Characters/leonid.png",
                "centered": false,
                "text": [
                    "При первой встрече с доктором получаем задание на поиск медикаментов.",
                    "У Калмыка на Болотах вымениваем 5 банок мази.",
                    "Калмык появляется во время выполнения %gl=quests/q_kot/0/2%заданий%egl% Кота на Болотах.",
                    "По всей зоне собираем 10 антидотов.",
                    "В госпитале в Восточной Припяти ломаем коробки и набираем по 10 шприцов, банок психоделина, антидотов и антибиотиков.",
                    "Возвращаемся на базу, отдаём вещи Леониду."
                ]
            },
            {
                "name": "Заведующий буфета",
                "header": "Заведующий буфета",
                "gridImagePath": "Characters/kulinar.png",
                "imagePath": "Characters/kulinar.png",
                "centered": false,
                "text": [
                    "1. После появления на базе доктора переговариваем с Халявой. Тот предлагает нанять бармена для базы.",
                    "2. Отправляемся на Свалку к Кулинару. Беседуем с Артёмом, возвращаемся на базу через какое-то время.",
                    "3. На базе Кулинар просит договориться с Барменом о поставках. Отправляемся в Бар.",
                    "4. Договариваемся с Барменом о поставках, возвращаемся на базу и рассказываем об этом Кулинару.",
                    "5. Кулинар просит заглянуть к Филу."
                ]
            },
            {
                "name": "Первый заказ",
                "header": "Первый заказ",
                "gridImagePath": "Characters/halyava.png",
                "imagePath": "Characters/halyava.png",
                "centered": false,
                "text": [
                    "1. В случайный момент получаем СМС от Халявы.",
                    "2. Приходим к Халяве, получаем заказ на один артефакт \"Батарейка\".",
                    "3. Приносим артефакт и идём по своим делам."
                ]
            },
            {
                "name": "Вор вне закона",
                "header": "Вор вне закона",
                "gridImagePath": "Characters/razboy.png",
                "imagePath": "Characters/razboy.png",
                "centered": false,
                "text": [
                    "1. В случайный момент получаем СМС от Лиса о воре на базе.",
                    "2. Приходим на базу, говорим с Филом по поводу выслеживания вора.",
                    "3. Быстро вычисляем %s%старого знакомого - Санька Разбойника с Кордона%es%.",
                    "4. Аккуратно следуем за ним до его схрона.",
                    "5. Ловим с поличным и под дулом ведём в подвал.",
                    "6. После ареста разговариваем с Филом о случившемся."
                ]
            },
            {
                "name": "Особая доставка",
                "header": "Особая доставка",
                "gridImagePath": "Characters/fil.png",
                "imagePath": "Characters/fil.png",
                "centered": false,
                "text": [
                    "1. После согласования поставок провизии с Барменом и передаче информации Кулинару отправляемся к Филу. Тот просит пригнать фуру из Лощины к главным воротам базы.",
                    "2. Отправляемся в Лощину, забираем ключи из тайника, садимся в фуру и едем в Тёмную Долину.",
                    "3. Привозим фуру к воротам, переговариваем с Филом."
                ]
            },
            {
                "name": "Полевая кухня",
                "header": "Полевая кухня",
                "gridImagePath": "Characters/kulinar.png",
                "imagePath": "Characters/kulinar.png",
                "centered": false,
                "text": [
                    "1. После доставки фуры разговариваем с Кулинаром. Тот просит пометить несколько предметов GPS-маячками и принести тушу кабана.",
                    "2. Тащим кабана до кухни и отправляемся помечать необходимые вещи:",
                    "Забытый Лес - Воз дров",
                    "Болота - Ёмкость для воды",
                    "Янтарь - Водонагреватель",
                    "Армейские Склады - Умывальник",
                    "Радар - Вертел",
                    "3. После пометки всех предметов разговариваем с Кулинаром."
                ]
            },
            {
                "name": "Проверка на практике",
                "header": "Проверка на практике",
                "gridImagePath": "Characters/leonid.png",
                "imagePath": "Characters/leonid.png",
                "centered": false,
                "text": [
                    "1. После доставки фуры разговариваем с Леонидом. Тот даёт Меченому три стабилизатора и просит проверить на тяжело раненных сталкерах.",
                    "2. Отправляемся искать тех, кого можно подлечить.",
                    "3. Докладываем Леониду о том, что стабилизатор действительно работает."
                ]
            },
            {
                "name": "Вылазка к вертолёту",
                "header": "Вылазка к вертолёту",
                "gridImagePath": "Characters/lis.png",
                "imagePath": "Characters/lis.png",
                "centered": false,
                "text": [
                    "1. После доставки фуры разговариваем с Лисом. Тот рассказывает Меченому об упавшем за болотом вертолёте.",
                    "2. Отправляемся к вертолёту, обыскиваем трупы.",
                    "3. Позади вертолёта находим контейнер высшей защищённости.",
                    "4. Приносим контейнер и документы Лису."
                ]
            },
            {
                "name": "Колонизация Зоны",
                "header": "Колонизация Зоны",
                "gridImagePath": "Locations/loshina.png",
                "imagePath": "Locations/loshina.png",
                "centered": false,
                "text": [
                    "1. После доставки фуры разговариваем с Халявой. Узнаём, что Серый, Крот и Бес хотят организовать в Лощине свою базу.",
                    "2. Отправляемся в Лощину навестить старых друзей. Разговариваем с Серым.",
                    "3. Докладываем Халяве. Узнаём, что пока Меченый был в Лощине, на базу пришёл водитель Жека. Также узнаём, что Халява выкупил КАМАЗ у военных.",
                    "4. Идём говорить с ним."
                ]
            },
            {
                "name": "Проверка на дорогах",
                "header": "Проверка на дорогах",
                "gridImagePath": "Characters/zheka.png",
                "imagePath": "Characters/zheka.png",
                "centered": false,
                "text": [
                    "1. После покупки Халявой КАМАЗа у военных переговариваем с Жекой. Получаем задания \"Экстренная заправка\" на доставку Жеке канистры с бензином и \"Проверка на дорогах\" на путешествие Бар-Лощина-Тёмная Долина.",
                    "2. Отправляемся в Бар к Петренко. Тот просит Меченого ликвидировать сталкера на Армейских Складах.",
                    "3. Уничтожаем оппонента Петренко, находим у него диктофон и получаем задание \"Голоса из преисподней\"",
                    "4. После уничтожения оппонента Петренко едем с Жекой в Лощину и говорим с Серым.",
                    "5. Приносим Жеке хотя бы одну канистру и завершаем задание на заправку."
                ]
            },
            {
                "name": "Золотые ручки",
                "header": "Золотые ручки",
                "gridImagePath": "Characters/lis.png",
                "imagePath": "Characters/lis.png",
                "centered": false,
                "text": [
                    "1. После поездки на КАМАЗе переговариваем с Жекой. Тот жалуется на плохое состояние КАМАЗа и просит поговорить с Лисом по поводу механика.",
                    "2. Говорим с Лисом. Узнаём о друге Лиса - Мише, который шёл на базу, но пропал в Красном Лесу. Лис просит сходить к Бармену с просьбой выделить механика (задание \"Технический вопрос\"), а также поискать торговца Вэла в Красном Лесу.",
                    "3. Говорим с Барменом. Тот посылает на базу механика Мотора."
                    "4. Отправляемся в Красный Лес к Вэлу."
                    "В работе..."
                ]
            },
            {
                "name": "Погоня в крови",
                "header": "Погоня в крови",
                "gridImagePath": "Characters/razboy.png",
                "imagePath": "Characters/razboy.png",
                "centered": false,
                "text": [
                    "1. Через некоторое время после ареста Разбойника Лис присылает СМС, где говорит, что тот убил охранника и сбежал.",
                    "2. Приходим на базу, осматриваем труп охранника, получаем наводку на логово Разбойника в Лощине.",
                    "3. Находим Разбойника в доме на юго-востоке Лощины..."
                ]
            },
            {
                "name": "Заблудшие души",
                "header": "Заблудшие души",
                "gridImagePath": "Characters/vist.png",
                "imagePath": "Characters/vist.png",
                "centered": false,
                "text": [
                    "1. Проходя мимо ворот базы, встречаем военного - Сержанта Михеева. Тот просит помочь отбить своего брата от наёмников на Дикой Территории.",
                    "2. Отправляемся к стройке на Дикой Территории.",
                    "3. Помогаем Вове сразиться с наёмниками, отправляем на базу к брату.",
                    "4. Переговариваем на Базе.",
                    "Вова Вист становится ответственным за разведку. Через него вербуются и снаряжаются разведчики, планируется разведка."
                ]
            },
            {
                "name": "Говорящая аномалия",
                "header": "Говорящая аномалия",
                "gridImagePath": "Characters/vist.png",
                "imagePath": "Characters/vist.png",
                "centered": false,
                "text": [
                    "1. Через некоторое время после отправки разведчиков на Янтарь Вова Вист присылает СМС о том, что один из разведчиков узнал о странной аномалии.",
                    "2. Отправляемся на Янтарь, разговариваем с разведчиком. Узнаём, что учёные обсуждали странную аномалию на болоте на Неразведанной Земле.",
                    "Путь к Неразведанной Земле открывается по ветке %gl=%поисков убийц Клыка%egl%."
                    "В работе..."
                ]
            },
            {
                "name": "Джентльмен Неизвестность",
                "header": "Джентльмен Неизвестность",
                "gridImagePath": "Locations/territory.png",
                "imagePath": "Locations/territory.png",
                "centered": false,
                "text": [
                    "1. После нахождения наёмника на болотах по ветке %gl=quests/q_expedition/0/5%поисков пропавшей экспедиции%egl%, в чат базы приходит СМС от неизвестного отправителя с просьбой прийти к тоннелю на Дикой Территории.",
                    "2. Переговариваем с Халявой, отправляемся на разведку.",
                    "3. В тоннеле находим доску с надписями, исследуем.",
                    "4. Получаем сообщение от незивестного отправителя с просьбой выйти из тоннеля и поговорить.",
                    "5. На выходе наёмники %s%вероломно нападают на Меченого, отбиваемся. Цель \"Поговорить с инкогнито\" остаётся невыполненной%es%.",
                    "6. Отправляемся к Костику. Тот рассказывает, что Хакер находится на Кордоне. Он ранен и ему нужна помощь.",
                    "7. Получаем у Кости лекарства и отправляемся на Кордон.",
                    "8. Находим Хакера, окружённого группой наёмников.",
                    "9. Уничтожаем наёмников, даём лекарства Хакеру и бежим в Лощину уничтожать антенну.",
                    "10. Уничтожаем антенну. Хакер в это время перебирается на базу."
                ]
            },
            {
                "name": "Одинокий заправщик",
                "header": "Одинокий заправщик",
                "gridImagePath": "Characters/hacker.png",
                "imagePath": "Characters/hacker.png",
                "centered": false,
                "text": [
                    "1. Получаем СМС от Хакера на базе.",
                    "2. Беседуем с Хакером. Тот рассказывает, что в полночь на заправке происходят странные дела. Отправляемся в полночь изучать заправку.",
                    "3. Уничтожаем волну мутантов, натыкаемся на %s%призрак друга Борова%es%.",
                    "4. Получаем задание \"Призрак Тёмной Долины\"."
                ]
            },
            {
                "name": "Призрак Тёмной Долины",
                "header": "Призрак Тёмной Долины",
                "gridImagePath": "Locations/dolina.png",
                "imagePath": "Locations/dolina.png",
                "centered": false,
                "text": [
                    "Призрак Корефана просит собрать части тела со всей зоны и принести к Алтарю.",
                    "Голову находим на Янтаре в тоннеле из X-16 на свободу.",
                    "В работе..."
                ]
            },
            {
                "name": "Интересная штуковина",
                "header": "Интересная штуковина",
                "gridImagePath": "Characters/bes.png",
                "imagePath": "Characters/bes.png",
                "centered": false,
                "text": [
                    "1. В процессе выполнения задания \"Призрак Тёмной Долины\" получаем СМС от Беса.",
                    "2. Беседуем с Бесом. Тот рассказывает, что хочет собрать лодку и открыть путь с Лощины в Восточную Припять.",
                    "3. Отправляемся к Хакеру за антеннами. Берём антенны, от Хакера узнаём места, куда их нужно установить. Получаем задание \"XXX\"",
                    "4. Также хакер просит найти 3 картриджа на заводе \"Юпитер\" для большой антенны на базе.",
                ]
            },
            {
                "name": "Картриджи для Хакера",
                "header": "Картриджи для Хакера",
                "gridImagePath": "Characters/hacker.png",
                "imagePath": "Characters/hacker.png",
                "centered": false,
                "text": [
                    "В работе..."
                ]
            },
            {
                "name": "Антенны для Беса",
                "header": "Антенны для Беса",
                "gridImagePath": "Characters/bes.png",
                "imagePath": "Characters/bes.png",
                "centered": false,
                "text": [
                    "В работе..."
                ]
            }
        ]
    }
]