[
    {
        "name": "Кот и поиски Чёрного Доктора",
        "header": "",
        "text": null,
        "centered": false,
        "imagePaths": null,
        "descriptions": [
            {
                "name": "Кот - Первая встреча",
                "header": "Кот",
                "gridImagePath": "Characters/kot.png",
                "imagePath": "Characters/kot.png",
                "centered": false,
                "text": [
                    "После получения от Дэна задания \"Кто этот парень?\" находим сталкера Кота на Болотах.",
                    "1. Получаем задание \"Карта для Кота\". Прогуливаемся с Котом до хутора, обыскиваем труп монолитовца.",
                    "2. Отстреливаем живность, отдаём найденную у монолитовца карту. Далее отправляемся по своим делам. Кот уходит на базу Чистого Неба..."
                ]
            },
            {
                "name": "Поиски монолитовцев",
                "header": "Поиски монолитовцев",
                "gridImagePath": "Characters/kot.png",
                "imagePath": "Characters/kot.png",
                "centered": false,
                "text": [
                    "1. Встречаемся с Котом на базе Чистого Неба, обсуждаем находку.",
                    "2. Кот просит Меченого попросить у местных помощи с поиском монолитовцев на Болотах.",
                    "3. Идём в каморку электронщика, тот соглашается помочь, но взамен требует телевизор.",
                    "4. Идём к %s%Акиму%es%. Получаем телевизор, относим электронщику. Получаем примерные координаты монолитовцев.",
                    "Монолитовцы находятся %s%на средней метке (чуть южнее железной дороги)%es%.",
                    "%img=Quests/Kot/kotbook.png%Дневник монолитовцев%eimg%",
                    "5. Забираем у одного из монолитовцев дневник, приносим Коту.",
                    "6. Пока Кот думает над дальнейшими действиями, он отправляет Меченого к сталкеру Калмыку за лекарством от радиации."
                ]
            },
            {
                "name": "Лекарство для Кота",
                "header": "Лекарство для Кота",
                "gridImagePath": "Characters/kalmik.png",
                "imagePath": "Characters/kalmik.png",
                "centered": false,
                "text": [
                    "1. После разговора с Котом отправляемся к Калмыку. Тому нужны ингредиенты для приготовления лекарства.",
                    "2. Отправляемся в лес за лапой медведя, попутно ищем \"Ночную Звезду\".",
                    "!! Где найти медведя, можно посмотреть на карте в ГИДе. !!",
                    "3. Сушим лапу в холодце(можно через трансмутатор). Приносим лапу и артефакт Калмыку, ждём 12 часов и забираем лекарство.",
                    "4. Приносим лекарство Коту, получаем в награду %s%Чёрный комбинезон \"Монолита\"%es%.",
                    "5. Идём по своим делам, дальше пересечёмся с Котом в Баре."
                ]
            },
            {
                "name": "Недостающая информация",
                "header": "Недостающая информация",
                "gridImagePath": "Characters/kot.png",
                "imagePath": "Characters/kot.png",
                "centered": false,
                "text": [
                    "1. Встречаемся с Котом в баре.",
                    "2. Узнаём о группе монолитовцев на Агропроме. Отправляемся на поиски.",
                    "3. На %s%юго-западе локации(около перехода на болота)%es% находим двух пленных сталкеров - Чука и Гека.",
                    "4. Уничтожаем монолитовцев, отводим Чука и Гека на базу сталкеров.",
                    "5. Переговариваем, получаем информацию и отправляемся к Коту.",
                    "6. Рассказываем информацию Коту, получаем задание \"Квартира Рабиновича\"."
                ]
            },
            {
                "name": "Квартира Рабиновича",
                "header": "Квартира Рабиновича",
                "gridImagePath": "icon0.png",
                "imagePath": "vasil.png",
                "centered": false,
                "text": [
                    "1. Отправляемся на Армейские Склады к Скряге за информацией о Рабиновиче.",
                    "Скряга при первой встрече выдаёт задание на уничтожение кровососов в старой деревне.",
                    "Уничтожаем, отчитываемся Скряге, получаем в награду %s%артефакт%es%.",
                    "2. Спрашиваем у Скряги про Рабиновича. Тот даёт наводку на сталкера Скромного, который провожал Рабиновича с Армейских складов.",
                    "3. Отправляемся в старую деревню к Джокеру(взяв с собой бутылку водки). Джокер рассказывает о том, как Скромный вечером убежал вглубь деревни.",
                    "4. Находим раненного Скромного, даём аптечку и спрашиваем о случившемся. Тот рассказывает, что его подстрелили неизвестные личности. Заодно рассказывает, что проводил Рабиновича на Радар. Тот, вероятно, двинулся в сторону Припяти.",
                    "5. После разговора появляются бандиты. Отбиваемся.",
                    "6. Отправляемся в Припять на поиски Рабиновича."
                ]
            }
        ]
    }
]